#!/usr/bin/env python
# encoding: utf-8
'''
@contact: 1650503480@qq.com
@file: day02_zuoye.py
@time: 2021/4/1 16:44
'''

'''
1、建一个列表list01 , 列表中的值通过 input函数输入 ，然后打印整个列表
2、有一个列表[1,2,3,40.5,6],把其中的小数转为整型输出
3、定义字符串列表，在列表中存入你喜欢的5首歌。请输出你最喜欢的歌名及他所在的位置。
4、定义字符串列表，把你喜欢的5个名星名字添加在列表中，把你最不喜欢的人名输出，修改第三号位置的人名。
5、有字典 dic = {"k1": "v1", "k2": "v2", "k3": "v3"}，实现以下功能：
   5.1 输出字典中所有的key
   5.2 输出字典中所有的value
   5.3  添加一个键值对"k4","v4",输出添加后的字典 dic
   5.4  删除字典 dic 中的键值对"k1","v1",并输出删除后的字典 dic
   5.5 删除字典 dic 中 'k5' 对应的值，若不存在，使其不报错，并返回None
   5.6 获取字典 dic 中“k2”对应的值
   5.7 有字典 dic2 = {'k1':"v111",'a':"b"} 通过一行操作使 dic2 = {'k1':"v111",'k2':"v2",'k3':"v3",'k4': 'v4','a':"b"}
6：现有列表如下：
list = [['k', ['qwe', 20, {'k1': ['tt', 3, '1']}, 89], 'ab']]
6.1 将列表中的‘tt’变成大写
6.2  获取列表中的 k1对应的值
'''

# 1、建一个列表list01 , 列表中的值通过 input函数输入 ，然后打印整个列表
# list01 = input('请输入你心里想的数字')
# print(list(list01))

# 2、有一个列表[1,2,3,40.5,6],把其中的小数转为整型输出
list02 = [1, 2, 3, 40.5, 6]
print(int(list02[3]))

results = list(map(int, list02))
print(results)

# 3、定义字符串列表，在列表中存入你喜欢的5首歌。请输出你最喜欢的歌名及他所在的位置。
list03 = ['jay:七里香', 'jay:花海', 'jay:听妈妈的话', 'jay:东风破', 'jay:一路向北']
print("我最喜欢的音乐：", list03[2], ',他的位置是在列表的第 ', list03.index('jay:听妈妈的话'), '位')

list04 = []
list04.insert(0, '七里香')
list04.append('花海')
list04.insert(2, '听麻麻的话')
list04.insert(3, '东风破')
list04.insert(4, '一路向北')
# list04.extend('听麻麻的话')  # 字符串拆分添加
print(list04)

# 4、定义字符串列表，把你喜欢的5个名星名字添加在列表中，把你最不喜欢的人名输出，修改第三号位置的人名。
list05 = ['雷佳音', '朱一龙', '周冬雨', '高圆圆', '张子枫']
print("最不喜欢的人名:", list05[2])
list05[2] = '郭京飞'
print(list05)

'''
5、有字典 dic = {"k1": "v1", "k2": "v2", "k3": "v3"}，实现以下功能：
   5.1 输出字典中所有的key
   5.2 输出字典中所有的value
   5.3  添加一个键值对"k4","v4",输出添加后的字典 dic
   5.4  删除字典 dic 中的键值对"k1","v1",并输出删除后的字典 dic
   5.5 删除字典 dic 中 'k5' 对应的值，若不存在，使其不报错，并返回None
   5.6 获取字典 dic 中“k2”对应的值
   5.7 有字典 dic2 = {'k1':"v111",'a':"b"} 通过一行操作使 dic2 = {'k1':"v111",'k2':"v2",'k3':"v3",'k4': 'v4','a':"b"}
'''
dic = {"k1": "v1", "k2": "v2", "k3": "v3"}
# 5.1 输出字典中所有的key
print(dic.keys())

# 5.2 输出字典中所有的value
print(dic.values())

# 5.3  添加一个键值对"k4","v4",输出添加后的字典 dic
dic1 = {'k4': 'v4'}
dic.update(dic1)  # update更新dic1列表至dic列表中
print(dic)

# 5.4  删除字典 dic 中的键值对"k1","v1",并输出删除后的字典 dic
dic.pop('k1')  # 删除列表中的元素
print(dic)

# 5.5 删除字典 dic 中 'k5' 对应的值，若不存在，使其不报错，并返回None
print('删除字典3中x', dic.pop('k5', '不存在该值--None'))

# 5.6 获取字典 dic 中“k2”对应的值
print(dic.get('k2'))  # get方法获取指定key的value值

#  5.7 有字典 dic2 = {'k1':"v111",'a':"b"} 通过一行操作使 dic2 = {'k1':"v111",'k2':"v2",'k3':"v3",'k4': 'v4','a':"b"}
dic1 = {"k2": "v2", "k3": "v3", "k4": "v3"}
dic2 = {'k1': "v111", 'a': "b"}
dic2.update(dic1)
print(dic2)

'''
6：现有列表如下：
list = [['k', ['qwe', 20, {'k1': ['tt', 3, '1']}, 89], 'ab']]
6.1 将列表中的‘tt’变成大写
6.2  获取列表中的 k1对应的值
'''
lists = [['k', ['qwe', 20, {'k1': ['tt', 3, '1']}, 89], 'ab']]

# 6.1 将列表中的‘tt’变成大写
print(lists[0][1][2]['k1'])  # 找出'k1'字典
print(lists[0][1][2]['k1'][0]) # 找出'k1'字典中的value
lists[0][1][2]['k1'][0] = lists[0][1][2]['k1'][0].upper()  # 重新赋值给lists TT
print(lists)
# 6.2  获取列表中的 k1对应的值
print("K1对应的值：", lists[0][1][2].values())
